experiments/results/thesis/host-NFS-Ceph/MT_10/fio_randread_16k_128_1_1.out
"randread_16k_128_1": (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=io_uring, iodepth=128
fio-3.28
Starting 1 thread

"randread_16k_128_1": (groupid=0, jobs=1): err= 0: pid=86799: Wed Aug  9 01:20:23 2023
  read: IOPS=2552, BW=39.9MiB/s (41.9MB/s)(2397MiB/60038msec)
    slat (usec): min=3, max=112, avg= 5.72, stdev= 2.48
    clat (usec): min=31217, max=92698, avg=50113.98, stdev=3172.72
     lat (usec): min=31222, max=92703, avg=50119.85, stdev=3172.72
    clat percentiles (usec):
     |  1.00th=[36963],  5.00th=[45351], 10.00th=[46400], 20.00th=[47973],
     | 30.00th=[49021], 40.00th=[49546], 50.00th=[50594], 60.00th=[51119],
     | 70.00th=[51643], 80.00th=[52167], 90.00th=[53216], 95.00th=[54264],
     | 99.00th=[56361], 99.50th=[56886], 99.90th=[58983], 99.95th=[61080],
     | 99.99th=[85459]
   bw (  KiB/s): min=38368, max=48192, per=99.99%, avg=40872.14, stdev=1652.08, samples=120
   iops        : min= 2398, max= 3012, avg=2554.48, stdev=103.27, samples=120
  lat (msec)   : 50=43.48%, 100=56.60%
  cpu          : usr=0.96%, sys=2.21%, ctx=149455, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=153260,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=39.9MiB/s (41.9MB/s), 39.9MiB/s-39.9MiB/s (41.9MB/s-41.9MB/s), io=2397MiB (2513MB), run=60038-60038msec